 
                             Library Compiler (TM)
                                 DesignWare (R)

               Version R-2020.09-SP5 for linux64 - Apr 14, 2021 

                    Copyright (c) 1988 - 2021 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
            or distribution of this software is strictly prohibited.

Initializing...
lc_shell> help
Specify a command name or wild card pattern to get help on individual
commands. Use the '-verbose' option to get detailed option help for
a command. Commands also provide help when the '-help' option is passed
to the command.'

You can also specify a command group to get the commands available in
that group. Available groups are:

  GUI:                       Graphical user interface
  Routing Via:               Routing via related utilities
  DRC Errors:                Error data from physical checks
  DMM:                       Design mismatches
  EMS:                       Messages generated by design checking
  Data Input Commands:       
  Physical Library Preparation Commands:
  Library Manager Commands:  Library generation and checking
  Data_Model:                Design data
  Shell:                     Collection and host information
  Procedures:                Miscellaneous procedures
  Help:                      Help commands
  Builtins:                  Generic Tcl commands
  Default Command Group:     Miscellaneous commands

lc_shell> read_lib libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c_syn.lib
Reading '/home/ghuang23/Desktop/ADV-VLSI-Design-/syn_pnr/libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c_syn.lib' ...
Warning: Line 64, The 'internal_power_calculation' attribute in char_config group is required for NLPM library. 
        No default can be applied to this attribute. (LBDB-366)
Warning: Line 1431, Cell 'dmem_sram', pin 'EMA[2]', The pin 'EMA[2]' does not have a internal_power group. (LBDB-607)
Warning: Line 1576, Cell 'dmem_sram', pin 'RETN', The pin 'RETN' does not have a internal_power group. (LBDB-607)
Information: Line 272, Cell 'dmem_sram', The cell 'dmem_sram' contiains memory/memory_read/memory_write groups which are deprecated, use the is_memory_cell attribute instead. (LIBG-280)
Technology library 'USERLIB_nldm_tt_1p00v_1p00v_25c' read successfully
1
lc_shell> write_lib libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c_
Warning: The 'libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c_' library has not been read in yet. (UIL-3)
0
lc_shell> write_lib libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c
Warning: The 'libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c' library has not been read in yet. (UIL-3)
0
lc_shell> read_lib libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c_syn.lib
Reading '/home/ghuang23/Desktop/ADV-VLSI-Design-/syn_pnr/libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c_syn.lib' ...
Warning: Line 64, The 'internal_power_calculation' attribute in char_config group is required for NLPM library. 
        No default can be applied to this attribute. (LBDB-366)
Warning: Line 1431, Cell 'dmem_sram', pin 'EMA[2]', The pin 'EMA[2]' does not have a internal_power group. (LBDB-607)
Warning: Line 1576, Cell 'dmem_sram', pin 'RETN', The pin 'RETN' does not have a internal_power group. (LBDB-607)
Information: Line 272, Cell 'dmem_sram', The cell 'dmem_sram' contiains memory/memory_read/memory_write groups which are deprecated, use the is_memory_cell attribute instead. (LIBG-280)
Warning: Overwriting an old technology library '/home/ghuang23/Desktop/ADV-VLSI-Design-/syn_pnr/libraries/USERLIB_nldm_tt_1p00v_1p00v_25c.db' file with a new one. (UIL-2)
1
lc_shell> write_lib libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c.db
Warning: The 'libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c.db' library has not been read in yet. (UIL-3)
0
lc_shell> write_lib libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c_syn.lib
Warning: The 'libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c_syn.lib' library has not been read in yet. (UIL-3)
0
lc_shell> read_lib libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c_syn.lib
Reading '/home/ghuang23/Desktop/ADV-VLSI-Design-/syn_pnr/libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c_syn.lib' ...
Warning: Line 64, The 'internal_power_calculation' attribute in char_config group is required for NLPM library. 
        No default can be applied to this attribute. (LBDB-366)
Warning: Line 1431, Cell 'dmem_sram', pin 'EMA[2]', The pin 'EMA[2]' does not have a internal_power group. (LBDB-607)
Warning: Line 1576, Cell 'dmem_sram', pin 'RETN', The pin 'RETN' does not have a internal_power group. (LBDB-607)
Information: Line 272, Cell 'dmem_sram', The cell 'dmem_sram' contiains memory/memory_read/memory_write groups which are deprecated, use the is_memory_cell attribute instead. (LIBG-280)
Warning: Overwriting an old technology library '/home/ghuang23/Desktop/ADV-VLSI-Design-/syn_pnr/libraries/USERLIB_nldm_tt_1p00v_1p00v_25c.db' file with a new one. (UIL-2)
1
lc_shell> write_lib libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c_syn.lib
Warning: The 'libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c_syn.lib' library has not been read in yet. (UIL-3)
0
lc_shell> read_lib libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c_syn.lib
Reading '/home/ghuang23/Desktop/ADV-VLSI-Design-/syn_pnr/libraries/dmem_sram_nldm_tt_1p00v_1p00v_25c_syn.lib' ...
Warning: Line 64, The 'internal_power_calculation' attribute in char_config group is required for NLPM library. 
        No default can be applied to this attribute. (LBDB-366)
Warning: Line 1431, Cell 'dmem_sram', pin 'EMA[2]', The pin 'EMA[2]' does not have a internal_power group. (LBDB-607)
Warning: Line 1576, Cell 'dmem_sram', pin 'RETN', The pin 'RETN' does not have a internal_power group. (LBDB-607)
Information: Line 272, Cell 'dmem_sram', The cell 'dmem_sram' contiains memory/memory_read/memory_write groups which are deprecated, use the is_memory_cell attribute instead. (LIBG-280)
Warning: Overwriting an old technology library '/home/ghuang23/Desktop/ADV-VLSI-Design-/syn_pnr/libraries/USERLIB_nldm_tt_1p00v_1p00v_25c.db' file with a new one. (UIL-2)
1
lc_shell> 